In [63]:
import pandas as pd

In [64]:
a=pd.DataFrame({"Ali":[2001,2002,2003,2004,2005,2006,2007,2008],"Shah":[1,2,3,4,5,6,6,6,5,3,2]})
a

ValueError: arrays must all be same length

In [65]:
a=pd.DataFrame({"Ali":[2001,2002,2003,2004,2005,2006,2007,2008],"Shah":[1,2,3,4,5,6,44,6]})
a

    Ali  Shah
0  2001     1
1  2002     2
2  2003     3
3  2004     4
4  2005     5
5  2006     6
6  2007    44
7  2008     6

In [66]:
pd.DataFrame({[2001,2002,2003,2004,2005,2006,2007,2008]:"Ali",[1,2,3,4,5,6,6,6,5,3,2]:"Shah"})

TypeError: unhashable type: 'list'

In [68]:
n=["a","b","c","d","e","f","g","h"]
a.index=[n]
a#no of indexes should neither be less nor more than the no of rows#error otherwise

    Ali  Shah
a  2001     1
b  2002     2
c  2003     3
d  2004     4
e  2005     5
f  2006     6
g  2007    44
h  2008     6

In [69]:
a.head()

    Ali  Shah
a  2001     1
b  2002     2
c  2003     3
d  2004     4
e  2005     5

In [70]:
a.head(3)

    Ali  Shah
a  2001     1
b  2002     2
c  2003     3

In [71]:
a.columns=["Shah","Ali"]
a

   Shah  Ali
a  2001    1
b  2002    2
c  2003    3
d  2004    4
e  2005    5
f  2006    6
g  2007   44
h  2008    6

In [72]:
c={"Syed":[0.1,0.2,0.2,0.3,0.4,5.2,2.2,0.2]}
b=pd.DataFrame(a,c)#c is a dictionary while a is a dataframe
b

TypeError: Expected tuple, got str

In [73]:
c=pd.DataFrame(c,index=n)

In [74]:
b=a+c
b

   Ali  Shah  Syed
a  NaN   NaN   NaN
b  NaN   NaN   NaN
c  NaN   NaN   NaN
d  NaN   NaN   NaN
e  NaN   NaN   NaN
f  NaN   NaN   NaN
g  NaN   NaN   NaN
h  NaN   NaN   NaN
a  NaN   NaN   NaN
b  NaN   NaN   NaN
c  NaN   NaN   NaN
d  NaN   NaN   NaN
e  NaN   NaN   NaN
f  NaN   NaN   NaN
g  NaN   NaN   NaN
h  NaN   NaN   NaN

In [75]:
a

   Shah  Ali
a  2001    1
b  2002    2
c  2003    3
d  2004    4
e  2005    5
f  2006    6
g  2007   44
h  2008    6

In [76]:
c

   Syed
a   0.1
b   0.2
c   0.2
d   0.3
e   0.4
f   5.2
g   2.2
h   0.2

In [80]:
import numpy as np
np.hstack((a,c))

array([[2.001e+03, 1.000e+00, 1.000e-01],
       [2.002e+03, 2.000e+00, 2.000e-01],
       [2.003e+03, 3.000e+00, 2.000e-01],
       [2.004e+03, 4.000e+00, 3.000e-01],
       [2.005e+03, 5.000e+00, 4.000e-01],
       [2.006e+03, 6.000e+00, 5.200e+00],
       [2.007e+03, 4.400e+01, 2.200e+00],
       [2.008e+03, 6.000e+00, 2.000e-01]])

In [85]:
aa=pd.DataFrame({"A":[1,2,3,5,6,6,4,3],"B":[1,
                                    23,6,6,2,5,2,43],"C":[14,6,5,6,3,43,2,13]})
aa

   A   B   C
0  1   1  14
1  2  23   6
2  3   6   5
3  5   6   6
4  6   2   3
5  6   5  43
6  4   2   2
7  3  43  13

In [86]:
bb=pd.DataFrame(aa,columns=["A","C","B","D"])

In [87]:
bb

   A   C   B   D
0  1  14   1 NaN
1  2   6  23 NaN
2  3   5   6 NaN
3  5   6   6 NaN
4  6   3   2 NaN
5  6  43   5 NaN
6  4   2   2 NaN
7  3  13  43 NaN

In [88]:
aa.columns

Index(['A', 'B', 'C'], dtype='object')

In [89]:
bb.columns

Index(['A', 'C', 'B', 'D'], dtype='object')

In [91]:
aa.index

RangeIndex(start=0, stop=8, step=1)

In [92]:
bb.index

RangeIndex(start=0, stop=8, step=1)

In [93]:
a.index

MultiIndex(levels=[['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']],
           codes=[[0, 1, 2, 3, 4, 5, 6, 7]])

In [94]:
a

   Shah  Ali
a  2001    1
b  2002    2
c  2003    3
d  2004    4
e  2005    5
f  2006    6
g  2007   44
h  2008    6

In [95]:
b.index

MultiIndex(levels=[['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']],
           codes=[[0, 1, 2, 3, 4, 5, 6, 7, 0, 1, 2, 3, 4, 5, 6, 7]],
           sortorder=0)

In [1]:
import pandas as pd

In [2]:
f4=pd.DataFrame({"Name":["Abdullah","Asad","Asim","Hassam"],"Reg no":[406,398,428,436],
              "City":["Faisalabad","Multan","Mianwali","Nankana"]})
f4.name="Four Muskeeteers"

In [3]:
f4

       Name  Reg no        City
0  Abdullah     406  Faisalabad
1      Asad     398      Multan
2      Asim     428    Mianwali
3    Hassam     436     Nankana

In [4]:
f4["Name"]#accessing like dictionary

0    Abdullah
1        Asad
2        Asim
3      Hassam
Name: Name, dtype: object

In [5]:
 f4.name

'Four Muskeeteers'

In [6]:
f4.Name

0    Abdullah
1        Asad
2        Asim
3      Hassam
Name: Name, dtype: object

In [7]:
f4.loc[1]

Name        Asad
Reg no       398
City      Multan
Name: 1, dtype: object

In [8]:
f4.loc["Name"]

KeyError: 'Name'

In [9]:
f4.loc[406]

KeyError: 406

In [10]:
ln=len(f4)

In [11]:
import numpy as np

In [12]:
tt=np.arange(ln)

In [13]:
f4["No"]=tt*tt

In [14]:
f4

       Name  Reg no        City  No
0  Abdullah     406  Faisalabad   0
1      Asad     398      Multan   1
2      Asim     428    Mianwali   4
3    Hassam     436     Nankana   9

In [15]:
f4["No"]=0

In [16]:
f4

       Name  Reg no        City  No
0  Abdullah     406  Faisalabad   0
1      Asad     398      Multan   0
2      Asim     428    Mianwali   0
3    Hassam     436     Nankana   0

In [17]:
f4

       Name  Reg no        City  No
0  Abdullah     406  Faisalabad   0
1      Asad     398      Multan   0
2      Asim     428    Mianwali   0
3    Hassam     436     Nankana   0

In [18]:
f4.loc[[0,1],["Reg no","Name"]]#use the name of the row or columns

   Reg no      Name
0     406  Abdullah
1     398      Asad

In [19]:
f4.iloc[[0,1],[2,1,0]]#use the index of the row or columns

         City  Reg no      Name
0  Faisalabad     406  Abdullah
1      Multan     398      Asad

In [20]:
f4

       Name  Reg no        City  No
0  Abdullah     406  Faisalabad   0
1      Asad     398      Multan   0
2      Asim     428    Mianwali   0
3    Hassam     436     Nankana   0

In [21]:
f4["Ph"]=["0321 7831957","0306 7790801","0306 5203916","0305 4627886"]

In [22]:
f4

       Name  Reg no        City  No            Ph
0  Abdullah     406  Faisalabad   0  0321 7831957
1      Asad     398      Multan   0  0306 7790801
2      Asim     428    Mianwali   0  0306 5203916
3    Hassam     436     Nankana   0  0305 4627886

In [23]:
f4=f4.iloc[:,[0,1,2,4]]

In [24]:
f4

       Name  Reg no        City            Ph
0  Abdullah     406  Faisalabad  0321 7831957
1      Asad     398      Multan  0306 7790801
2      Asim     428    Mianwali  0306 5203916
3    Hassam     436     Nankana  0305 4627886

In [25]:
f4["Caption"]=["I don't even care","Available","Battery about to die","Mast hun apne zawal main"]

In [26]:
f4

       Name  Reg no        City            Ph                   Caption
0  Abdullah     406  Faisalabad  0321 7831957         I don't even care
1      Asad     398      Multan  0306 7790801                 Available
2      Asim     428    Mianwali  0306 5203916      Battery about to die
3    Hassam     436     Nankana  0305 4627886  Mast hun apne zawal main

In [27]:
f4.iloc[:,4]

0           I don't even care
1                   Available
2        Battery about to die
3    Mast hun apne zawal main
Name: Caption, dtype: object

In [28]:
f4.iloc[:,3]

0    0321 7831957
1    0306 7790801
2    0306 5203916
3    0305 4627886
Name: Ph, dtype: object

In [29]:
index=["one","two","three"]
df1=pd.DataFrame(np.arange(9).reshape(3,3),columns=list("bcd"),index=index)
df2=pd.DataFrame(np.arange(12).reshape(3,4),columns=list("bdef"),index=index)

In [30]:
df1

       b  c  d
one    0  1  2
two    3  4  5
three  6  7  8

In [31]:
df2

       b  d   e   f
one    0  1   2   3
two    4  5   6   7
three  8  9  10  11

In [32]:
df1+df2

        b   c   d   e   f
one     0 NaN   3 NaN NaN
two     7 NaN  10 NaN NaN
three  14 NaN  17 NaN NaN

In [42]:
df3=pd.DataFrame(np.arange(16).reshape(4,4),columns=list("abcd")
                 ,index=index.append("four"))

In [43]:
df4=pd.DataFrame(np.arange(20).reshape(4,5),columns=list("gacde")
                 ,index=index.append("four"))

In [44]:
df3

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [45]:
df4

    g   a   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [46]:
df3+df4

    a   b   c   d   e   g
0   1 NaN   4   6 NaN NaN
1  10 NaN  13  15 NaN NaN
2  19 NaN  22  24 NaN NaN
3  28 NaN  31  33 NaN NaN

In [48]:
df3.add(df4,fill_value=12)#it will firstly fill the given value in the matrix
#which is missing with respect to other DataFrame and then add both df's

    a     b   c   d     e     g
0   1  13.0   4   6  16.0  12.0
1  10  17.0  13  15  21.0  17.0
2  19  21.0  22  24  26.0  22.0
3  28  25.0  31  33  31.0  27.0

In [49]:
df3

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [52]:
g=pd.Series([5,1,2],index=list("abc"))

In [53]:
df3-g

     a     b     c   d
0 -5.0   0.0   0.0 NaN
1 -1.0   4.0   4.0 NaN
2  3.0   8.0   8.0 NaN
3  7.0  12.0  12.0 NaN

In [56]:
def min_max(a):
    return pd.Series([a.min(),a.max()],index=["min","max"])
(df3-g).apply(min_max)

       a     b     c   d
min -5.0   0.0   0.0 NaN
max  7.0  12.0  12.0 NaN

In [57]:
df4

    g   a   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [58]:
df4.sort_index(axis=0)#by default axis=0

    g   a   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [59]:
df4.sort_index(axis=1)

    a   c   d   e   g
0   1   2   3   4   0
1   6   7   8   9   5
2  11  12  13  14  10
3  16  17  18  19  15

In [61]:
df4.sort_index(axis=1,ascending=False)

    g   e   d   c   a
0   0   4   3   2   1
1   5   9   8   7   6
2  10  14  13  12  11
3  15  19  18  17  16

In [63]:
df4.sort_index(axis=1,ascending=True)

    a   c   d   e   g
0   1   2   3   4   0
1   6   7   8   9   5
2  11  12  13  14  10
3  16  17  18  19  15

In [64]:
df4

    g   a   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [65]:
f4

       Name  Reg no        City            Ph                   Caption
0  Abdullah     406  Faisalabad  0321 7831957         I don't even care
1      Asad     398      Multan  0306 7790801                 Available
2      Asim     428    Mianwali  0306 5203916      Battery about to die
3    Hassam     436     Nankana  0305 4627886  Mast hun apne zawal main

In [66]:
f4.sort_values(by="City")

       Name  Reg no        City            Ph                   Caption
0  Abdullah     406  Faisalabad  0321 7831957         I don't even care
2      Asim     428    Mianwali  0306 5203916      Battery about to die
1      Asad     398      Multan  0306 7790801                 Available
3    Hassam     436     Nankana  0305 4627886  Mast hun apne zawal main

In [67]:
f4.rank(ascending=False,method="max")

   Name  Reg no  City   Ph  Caption
0   4.0     3.0   4.0  1.0      2.0
1   3.0     4.0   2.0  2.0      4.0
2   2.0     2.0   3.0  3.0      3.0
3   1.0     1.0   1.0  4.0      1.0

In [68]:
f4.rank(ascending=True,method="max")

   Name  Reg no  City   Ph  Caption
0   1.0     2.0   1.0  4.0      3.0
1   2.0     1.0   3.0  3.0      1.0
2   3.0     3.0   2.0  2.0      2.0
3   4.0     4.0   4.0  1.0      4.0

In [69]:
f4.rank(axis=0)

   Name  Reg no  City   Ph  Caption
0   1.0     2.0   1.0  4.0      3.0
1   2.0     1.0   3.0  3.0      1.0
2   3.0     3.0   2.0  2.0      2.0
3   4.0     4.0   4.0  1.0      4.0

In [71]:
f4.rank(axis="columns")

   Reg no
0     1.0
1     1.0
2     1.0
3     1.0

In [72]:
f4.rank(axis="rows")

   Name  Reg no  City   Ph  Caption
0   1.0     2.0   1.0  4.0      3.0
1   2.0     1.0   3.0  3.0      1.0
2   3.0     3.0   2.0  2.0      2.0
3   4.0     4.0   4.0  1.0      4.0

In [73]:
df3

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [74]:
df3.sum()

a    24
b    28
c    32
d    36
dtype: int64

In [75]:
df3.sum(axis="columns")

0     6
1    22
2    38
3    54
dtype: int64

In [76]:
df3.mean(axis="columns")

0     1.5
1     5.5
2     9.5
3    13.5
dtype: float64

In [77]:
df3.mean()

a    6.0
b    7.0
c    8.0
d    9.0
dtype: float64

In [81]:
df3.iloc[2,2]=np.nan

In [82]:
df3

    a   b     c   d  (2, 2)
0   0   1   2.0   3     NaN
1   4   5   6.0   7     NaN
2   8   9   NaN  11     NaN
3  12  13  14.0  15     NaN

In [83]:
df3=df3.iloc[:,:4]

In [84]:
df3

    a   b     c   d
0   0   1   2.0   3
1   4   5   6.0   7
2   8   9   NaN  11
3  12  13  14.0  15

In [85]:
df3.mean()

a    6.000000
b    7.000000
c    7.333333
d    9.000000
dtype: float64

In [86]:
df3.mean(skipna=False)

a    6.0
b    7.0
c    NaN
d    9.0
dtype: float64

In [87]:
f4["Name"].unique

<bound method Series.unique of 0    Abdullah
1        Asad
2        Asim
3      Hassam
Name: Name, dtype: object>

In [89]:
f4["Reg no"].value_counts()

398    1
406    1
428    1
436    1
Name: Reg no, dtype: int64

In [92]:
f4.Ph

0    0321 7831957
1    0306 7790801
2    0306 5203916
3    0305 4627886
Name: Ph, dtype: object

In [93]:
f4["Reg no"]>400

0     True
1    False
2     True
3     True
Name: Reg no, dtype: bool

In [94]:
f4["GPA"]=4

In [95]:
f4

       Name  Reg no        City            Ph                   Caption  GPA
0  Abdullah     406  Faisalabad  0321 7831957         I don't even care    4
1      Asad     398      Multan  0306 7790801                 Available    4
2      Asim     428    Mianwali  0306 5203916      Battery about to die    4
3    Hassam     436     Nankana  0305 4627886  Mast hun apne zawal main    4

In [99]:
f4.drop("GPA",axis=1,inplace=True)

In [100]:
f4

       Name  Reg no        City            Ph                   Caption
0  Abdullah     406  Faisalabad  0321 7831957         I don't even care
1      Asad     398      Multan  0306 7790801                 Available
2      Asim     428    Mianwali  0306 5203916      Battery about to die
3    Hassam     436     Nankana  0305 4627886  Mast hun apne zawal main

In [103]:
f4.drop(2,axis=0)

       Name  Reg no        City            Ph                   Caption
0  Abdullah     406  Faisalabad  0321 7831957         I don't even care
1      Asad     398      Multan  0306 7790801                 Available
3    Hassam     436     Nankana  0305 4627886  Mast hun apne zawal main

In [104]:
f4

       Name  Reg no        City            Ph                   Caption
0  Abdullah     406  Faisalabad  0321 7831957         I don't even care
1      Asad     398      Multan  0306 7790801                 Available
2      Asim     428    Mianwali  0306 5203916      Battery about to die
3    Hassam     436     Nankana  0305 4627886  Mast hun apne zawal main

In [109]:
r=pd.Series(list("abx"),index=[0,3,8])
print(r)
r.reindex(range(9),method="ffill")

0    a
3    b
8    x
dtype: object

0    a
1    a
2    a
3    b
4    b
5    b
6    b
7    b
8    x
dtype: object